## Staging: ssm
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                      RESOURCE                       |
|--------|-----------------------------------------------------|
| add    | `aws_ssm_parameter.app_settings[&quot;cache-timeout&quot;]`   |
|        | `aws_ssm_parameter.app_settings[&quot;max-upload-size&quot;]` |
|        | `aws_ssm_parameter.database_name`                   |
|        | `aws_ssm_parameter.database_password`               |
|        | `aws_ssm_parameter.database_username`               |
|        | `aws_ssm_parameter.django_secret_key`               |

| CHANGE |            OUTPUT            |
|--------|------------------------------|
| add    | `additional_parameter_arns`  |
|        | `additional_parameter_names` |
|        | `parameter_arns`             |
|        | `parameter_names`            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ssm_parameter.app_settings["cache-timeout"] will be created
  + resource "aws_ssm_parameter" "app_settings" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Additional parameter cache-timeout for Blawx staging"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/blawx/staging/app/cache-timeout"
      + region         = "ca-central-1"
      + tags           = {
          + "CostCentre"  = "blawx-staging"
          + "Environment" = "staging"
          + "Name"        = "blawx-staging-cache-timeout"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "CostCentre"  = "blawx-staging"
          + "Environment" = "staging"
          + "Name"        = "blawx-staging-cache-timeout"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.app_settings["max-upload-size"] will be created
  + resource "aws_ssm_parameter" "app_settings" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Additional parameter max-upload-size for Blawx staging"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/blawx/staging/app/max-upload-size"
      + region         = "ca-central-1"
      + tags           = {
          + "CostCentre"  = "blawx-staging"
          + "Environment" = "staging"
          + "Name"        = "blawx-staging-max-upload-size"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "CostCentre"  = "blawx-staging"
          + "Environment" = "staging"
          + "Name"        = "blawx-staging-max-upload-size"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.database_name will be created
  + resource "aws_ssm_parameter" "database_name" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Database name for Blawx staging environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = "alias/aws/ssm"
      + name           = "/blawx/staging/database_name"
      + region         = "ca-central-1"
      + tags           = {
          + "CostCentre"  = "blawx-staging"
          + "Environment" = "staging"
          + "Name"        = "blawx-staging-database-name"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "CostCentre"  = "blawx-staging"
          + "Environment" = "staging"
          + "Name"        = "blawx-staging-database-name"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.database_password will be created
  + resource "aws_ssm_parameter" "database_password" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Database password for Blawx staging environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = "alias/aws/ssm"
      + name           = "/blawx/staging/database_password"
      + region         = "ca-central-1"
      + tags           = {
          + "CostCentre"  = "blawx-staging"
          + "Environment" = "staging"
          + "Name"        = "blawx-staging-database-password"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "CostCentre"  = "blawx-staging"
          + "Environment" = "staging"
          + "Name"        = "blawx-staging-database-password"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.database_username will be created
  + resource "aws_ssm_parameter" "database_username" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Database username for Blawx staging environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = "alias/aws/ssm"
      + name           = "/blawx/staging/database_username"
      + region         = "ca-central-1"
      + tags           = {
          + "CostCentre"  = "blawx-staging"
          + "Environment" = "staging"
          + "Name"        = "blawx-staging-database-username"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "CostCentre"  = "blawx-staging"
          + "Environment" = "staging"
          + "Name"        = "blawx-staging-database-username"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.django_secret_key will be created
  + resource "aws_ssm_parameter" "django_secret_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Django secret key for Blawx staging environment"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = "alias/aws/ssm"
      + name           = "/blawx/staging/django_secret_key"
      + region         = "ca-central-1"
      + tags           = {
          + "CostCentre"  = "blawx-staging"
          + "Environment" = "staging"
          + "Name"        = "blawx-staging-django-secret-key"
          + "Terraform"   = "true"
        }
      + tags_all       = {
          + "CostCentre"  = "blawx-staging"
          + "Environment" = "staging"
          + "Name"        = "blawx-staging-django-secret-key"
          + "Terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + additional_parameter_arns  = {
      + cache-timeout   = (known after apply)
      + max-upload-size = (known after apply)
    }
  + additional_parameter_names = {
      + cache-timeout   = "/blawx/staging/app/cache-timeout"
      + max-upload-size = "/blawx/staging/app/max-upload-size"
    }
  + parameter_arns             = {
      + database_name     = (known after apply)
      + database_password = (known after apply)
      + database_username = (known after apply)
      + django_secret_key = (known after apply)
    }
  + parameter_names            = {
      + database_name     = "/blawx/staging/database_name"
      + database_password = "/blawx/staging/database_password"
      + database_username = "/blawx/staging/database_username"
      + django_secret_key = "/blawx/staging/django_secret_key"
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
